In [1]:
import pandas as pd

In [5]:
data = [2,3,4,5,6,7]
series = pd.Series(data)
print(series)

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [15]:
d = {
    'Place': [ 'Navi mumbai' ,'Kharghar','Mumbai','Delhi'],
    'Age' : [18,19,21,26]
}
df = pd.DataFrame(d)
print(df)

         Place  Age
0  Navi mumbai   18
1     Kharghar   19
2       Mumbai   21
3        Delhi   26

In [47]:
df = pd.DataFrame(d)
print(df.dtypes)

Place    object
Age       int64
dtype: object

In [49]:
print(df.describe())

             Age
count   4.000000
mean   21.000000
std     3.559026
min    18.000000
25%    18.750000
50%    20.000000
75%    22.250000
max    26.000000

In [51]:
print(df.describe(include='all'))

              Place        Age
count             4   4.000000
unique            4        NaN
top     Navi mumbai        NaN
freq              1        NaN
mean            NaN  21.000000
std             NaN   3.559026
min             NaN  18.000000
25%             NaN  18.750000
50%             NaN  20.000000
75%             NaN  22.250000
max             NaN  26.000000

In [53]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Place   4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes
None

In [57]:
df.to_excel("processed_data.xlsx", index=False)
print("DataFrame exported to Excel successfully")

DataFrame exported to Excel successfully

In [21]:
s = {
     's1': ['Python','ML','NLP','DL'],
    's2': ['9','8','7','9'],
    's3': ['7','8','9','9']
}
df = pd.DataFrame(s)
print(df)

       s1 s2 s3
0  Python  9  7
1      ML  8  8
2     NLP  7  9
3      DL  9  9

In [43]:
n = 3
print(df.head(n))

       s1 s2 s3
0  Python  9  7
1      ML  8  8
2     NLP  7  9

In [45]:
m = 1
print(df.tail(m))

   s1 s2 s3
3  DL  9  9

In [29]:
fd = pd.read_excel('new.xlsx')
print(fd.head())

   Table 1 Unnamed: 1 Unnamed: 2 Unnamed: 3
0      NaN        NaN        NaN        NaN
1      NaN       Name        Age      Place
2      NaN      Rohan         16  Australia
3      NaN        Sam         17  Melbourne
4      NaN       Tiya         18   New York

In [35]:
fd = pd.read_csv('new.csv')
print(fd)

                                           Table 1
NaN NaN    NaN NaN         NaN        NaN      NaN
    Name   Age Place       Fav        NaN      NaN
    Rohan  16  Australia   Books      NaN      NaN
    Sam    17  Melbourne   Football   NaN      NaN
    Tiya   18  New York    Music      NaN      NaN
    Urmila 19  Los Angeles Chocolates NaN      NaN
    Vedant 20  Singapore   -          NaN      NaN